/* automatically generated by rust-bindgen 0.59.2 */

pub type ULONG = ::std::os::raw::c_ulong;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type DWORD = ::std::os::raw::c_ulong;
pub type UINT = ::std::os::raw::c_uint;
pub type __time64_t = ::std::os::raw::c_longlong;
pub type time_t = __time64_t;
pub type INT64 = ::std::os::raw::c_longlong;
pub type CHAR = ::std::os::raw::c_char;
pub type WCHAR = u16;
pub type LPCWSTR = *const WCHAR;
pub type LPCSTR = *const CHAR;
pub type COLORREF = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        36usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        4usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PluginInfo {
    pub name: [::std::os::raw::c_char; 128usize],
    pub version: ::std::os::raw::c_uint,
    pub copyright: [::std::os::raw::c_char; 128usize],
    pub reserved: [::std::os::raw::c_int; 32usize],
}
#[test]
fn bindgen_test_layout_PluginInfo() {
    assert_eq!(
        ::std::mem::size_of::<PluginInfo>(),
        388usize,
        concat!("Size of: ", stringify!(PluginInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<PluginInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(PluginInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginInfo>())).version as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginInfo),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginInfo>())).copyright as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginInfo),
            "::",
            stringify!(copyright)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginInfo>())).reserved as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginInfo),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PluginCfg {
    pub name: [::std::os::raw::c_char; 32usize],
    pub value: [::std::os::raw::c_char; 128usize],
    pub reserved: [::std::os::raw::c_int; 16usize],
}
#[test]
fn bindgen_test_layout_PluginCfg() {
    assert_eq!(
        ::std::mem::size_of::<PluginCfg>(),
        224usize,
        concat!("Size of: ", stringify!(PluginCfg))
    );
    assert_eq!(
        ::std::mem::align_of::<PluginCfg>(),
        4usize,
        concat!("Alignment of ", stringify!(PluginCfg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginCfg>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginCfg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginCfg>())).value as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginCfg),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PluginCfg>())).reserved as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(PluginCfg),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConAccess {
    pub action: ::std::os::raw::c_int,
    pub from: ::std::os::raw::c_ulong,
    pub to: ::std::os::raw::c_ulong,
    pub comment: [::std::os::raw::c_char; 64usize],
    pub reserved: [::std::os::raw::c_int; 17usize],
}
#[test]
fn bindgen_test_layout_ConAccess() {
    assert_eq!(
        ::std::mem::size_of::<ConAccess>(),
        144usize,
        concat!("Size of: ", stringify!(ConAccess))
    );
    assert_eq!(
        ::std::mem::align_of::<ConAccess>(),
        4usize,
        concat!("Alignment of ", stringify!(ConAccess))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConAccess>())).action as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConAccess),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConAccess>())).from as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConAccess),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConAccess>())).to as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConAccess),
            "::",
            stringify!(to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConAccess>())).comment as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConAccess),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConAccess>())).reserved as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ConAccess),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConCommon {
    pub owner: [::std::os::raw::c_char; 128usize],
    pub name: [::std::os::raw::c_char; 32usize],
    pub address: ULONG,
    pub port: ::std::os::raw::c_int,
    pub timeout: DWORD,
    pub enable_demo: ::std::os::raw::c_int,
    pub timeofdemo: ::std::os::raw::c_int,
    pub daylightcorrection: ::std::os::raw::c_int,
    pub internal: [::std::os::raw::c_char; 60usize],
    pub timezone_real: ::std::os::raw::c_int,
    pub timezone: ::std::os::raw::c_int,
    pub timesync: [::std::os::raw::c_char; 64usize],
    pub minclient: ::std::os::raw::c_int,
    pub minapi: ::std::os::raw::c_int,
    pub feeder_timeout: DWORD,
    pub keepemails: ::std::os::raw::c_int,
    pub endhour: ::std::os::raw::c_int,
    pub endminute: ::std::os::raw::c_int,
    pub optimization_time: ::std::os::raw::c_int,
    pub optimization_lasttime: ::std::os::raw::c_int,
    pub optimization_counter: ::std::os::raw::c_int,
    pub optimization_unused: [::std::os::raw::c_int; 8usize],
    pub antiflood: ::std::os::raw::c_int,
    pub floodcontrol: ::std::os::raw::c_int,
    pub liveupdate_mode: ::std::os::raw::c_int,
    pub lastorder: ::std::os::raw::c_int,
    pub lastlogin: ::std::os::raw::c_int,
    pub lostlogin: ::std::os::raw::c_int,
    pub rollovers_mode: ::std::os::raw::c_int,
    pub path_database: [::std::os::raw::c_char; 256usize],
    pub path_history: [::std::os::raw::c_char; 256usize],
    pub path_log: [::std::os::raw::c_char; 256usize],
    pub overnight_last_day: time_t,
    pub overnight_last_time: time_t,
    pub overnight_prev_time: time_t,
    pub overmonth_last_month: time_t,
    pub adapters: [::std::os::raw::c_char; 256usize],
    pub bind_adresses: [ULONG; 8usize],
    pub server_version: ::std::os::raw::c_short,
    pub server_build: ::std::os::raw::c_short,
    pub web_adresses: [ULONG; 8usize],
    pub statement_mode: ::std::os::raw::c_int,
    pub monthly_state_mode: ::std::os::raw::c_int,
    pub keepticks: ::std::os::raw::c_int,
    pub statement_weekend: ::std::os::raw::c_int,
    pub last_activate: time_t,
    pub stop_last: time_t,
    pub stop_delay: ::std::os::raw::c_int,
    pub stop_reason: ::std::os::raw::c_int,
    pub account_url: [::std::os::raw::c_char; 128usize],
    pub reserved: [::std::os::raw::c_int; 16usize],
}
#[test]
fn bindgen_test_layout_ConCommon() {
    assert_eq!(
        ::std::mem::size_of::<ConCommon>(),
        1776usize,
        concat!("Size of: ", stringify!(ConCommon))
    );
    assert_eq!(
        ::std::mem::align_of::<ConCommon>(),
        8usize,
        concat!("Alignment of ", stringify!(ConCommon))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).owner as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).name as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).address as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).port as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).timeout as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).enable_demo as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(enable_demo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).timeofdemo as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(timeofdemo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).daylightcorrection as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(daylightcorrection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).internal as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(internal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).timezone_real as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(timezone_real)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).timezone as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(timezone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).timesync as *const _ as usize },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(timesync)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).minclient as *const _ as usize },
        316usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(minclient)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).minapi as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(minapi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).feeder_timeout as *const _ as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(feeder_timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).keepemails as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(keepemails)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).endhour as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(endhour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).endminute as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(endminute)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).optimization_time as *const _ as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(optimization_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).optimization_lasttime as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(optimization_lasttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).optimization_counter as *const _ as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(optimization_counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).optimization_unused as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(optimization_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).antiflood as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(antiflood)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).floodcontrol as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(floodcontrol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).liveupdate_mode as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(liveupdate_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).lastorder as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(lastorder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).lastlogin as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(lastlogin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).lostlogin as *const _ as usize },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(lostlogin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).rollovers_mode as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(rollovers_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).path_database as *const _ as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(path_database)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).path_history as *const _ as usize },
        668usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(path_history)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).path_log as *const _ as usize },
        924usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(path_log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).overnight_last_day as *const _ as usize },
        1184usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(overnight_last_day)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).overnight_last_time as *const _ as usize },
        1192usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(overnight_last_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).overnight_prev_time as *const _ as usize },
        1200usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(overnight_prev_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).overmonth_last_month as *const _ as usize },
        1208usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(overmonth_last_month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).adapters as *const _ as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(adapters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).bind_adresses as *const _ as usize },
        1472usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(bind_adresses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).server_version as *const _ as usize },
        1504usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(server_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).server_build as *const _ as usize },
        1506usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(server_build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).web_adresses as *const _ as usize },
        1508usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(web_adresses)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).statement_mode as *const _ as usize },
        1540usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(statement_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).monthly_state_mode as *const _ as usize },
        1544usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(monthly_state_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).keepticks as *const _ as usize },
        1548usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(keepticks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).statement_weekend as *const _ as usize },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(statement_weekend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).last_activate as *const _ as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(last_activate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).stop_last as *const _ as usize },
        1568usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(stop_last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).stop_delay as *const _ as usize },
        1576usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(stop_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).stop_reason as *const _ as usize },
        1580usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(stop_reason)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).account_url as *const _ as usize },
        1584usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(account_url)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConCommon>())).reserved as *const _ as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(ConCommon),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConTime {
    pub days: [[::std::os::raw::c_int; 24usize]; 7usize],
    pub dayscontrol: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 3usize],
}
#[test]
fn bindgen_test_layout_ConTime() {
    assert_eq!(
        ::std::mem::size_of::<ConTime>(),
        688usize,
        concat!("Size of: ", stringify!(ConTime))
    );
    assert_eq!(
        ::std::mem::align_of::<ConTime>(),
        4usize,
        concat!("Alignment of ", stringify!(ConTime))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConTime>())).days as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConTime),
            "::",
            stringify!(days)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConTime>())).dayscontrol as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(ConTime),
            "::",
            stringify!(dayscontrol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConTime>())).reserved as *const _ as usize },
        676usize,
        concat!(
            "Offset of field: ",
            stringify!(ConTime),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConBackup {
    pub fullbackup_path: [::std::os::raw::c_char; 256usize],
    pub fullbackup_period: ::std::os::raw::c_int,
    pub fullbackup_store: ::std::os::raw::c_int,
    pub fullbackup_lasttime: time_t,
    pub fullbackup_shift: ::std::os::raw::c_short,
    pub external_path: [::std::os::raw::c_char; 256usize],
    pub archive_period: ::std::os::raw::c_int,
    pub archive_store: ::std::os::raw::c_int,
    pub archive_lasttime: time_t,
    pub export_securities: [::std::os::raw::c_char; 512usize],
    pub export_path: [::std::os::raw::c_char; 256usize],
    pub export_period: ::std::os::raw::c_int,
    pub export_lasttime: time_t,
    pub watch_role: ::std::os::raw::c_int,
    pub watch_password: [::std::os::raw::c_char; 16usize],
    pub watch_opposite: [::std::os::raw::c_char; 24usize],
    pub watch_ip: ::std::os::raw::c_ulong,
    pub archive_shift: ::std::os::raw::c_char,
    pub watch_state: ::std::os::raw::c_char,
    pub watch_failover: ::std::os::raw::c_char,
    pub watch_timeout: ::std::os::raw::c_uchar,
    pub watch_login: ::std::os::raw::c_int,
    pub watch_timestamp: time_t,
}
#[test]
fn bindgen_test_layout_ConBackup() {
    assert_eq!(
        ::std::mem::size_of::<ConBackup>(),
        1400usize,
        concat!("Size of: ", stringify!(ConBackup))
    );
    assert_eq!(
        ::std::mem::align_of::<ConBackup>(),
        8usize,
        concat!("Alignment of ", stringify!(ConBackup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).fullbackup_path as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(fullbackup_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).fullbackup_period as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(fullbackup_period)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).fullbackup_store as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(fullbackup_store)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).fullbackup_lasttime as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(fullbackup_lasttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).fullbackup_shift as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(fullbackup_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).external_path as *const _ as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(external_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).archive_period as *const _ as usize },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(archive_period)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).archive_store as *const _ as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(archive_store)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).archive_lasttime as *const _ as usize },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(archive_lasttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).export_securities as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(export_securities)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).export_path as *const _ as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(export_path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).export_period as *const _ as usize },
        1320usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(export_period)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).export_lasttime as *const _ as usize },
        1328usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(export_lasttime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_role as *const _ as usize },
        1336usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_role)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_password as *const _ as usize },
        1340usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_opposite as *const _ as usize },
        1356usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_opposite)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_ip as *const _ as usize },
        1380usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).archive_shift as *const _ as usize },
        1384usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(archive_shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_state as *const _ as usize },
        1385usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_failover as *const _ as usize },
        1386usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_failover)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_timeout as *const _ as usize },
        1387usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_login as *const _ as usize },
        1388usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConBackup>())).watch_timestamp as *const _ as usize },
        1392usize,
        concat!(
            "Offset of field: ",
            stringify!(ConBackup),
            "::",
            stringify!(watch_timestamp)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConFeeder {
    pub name: [::std::os::raw::c_char; 64usize],
    pub file: [::std::os::raw::c_char; 256usize],
    pub server: [::std::os::raw::c_char; 64usize],
    pub login: [::std::os::raw::c_char; 32usize],
    pub pass: [::std::os::raw::c_char; 32usize],
    pub keywords: [::std::os::raw::c_char; 256usize],
    pub enable: ::std::os::raw::c_int,
    pub mode: ::std::os::raw::c_int,
    pub timeout: ::std::os::raw::c_int,
    pub timeout_reconnect: ::std::os::raw::c_int,
    pub timeout_sleep: ::std::os::raw::c_int,
    pub attemps_sleep: ::std::os::raw::c_int,
    pub news_langid: ::std::os::raw::c_int,
    pub unused: [::std::os::raw::c_int; 33usize],
}
#[test]
fn bindgen_test_layout_ConFeeder() {
    assert_eq!(
        ::std::mem::size_of::<ConFeeder>(),
        864usize,
        concat!("Size of: ", stringify!(ConFeeder))
    );
    assert_eq!(
        ::std::mem::align_of::<ConFeeder>(),
        4usize,
        concat!("Alignment of ", stringify!(ConFeeder))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).file as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).server as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).login as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).pass as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(pass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).keywords as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(keywords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).enable as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).mode as *const _ as usize },
        708usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).timeout as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).timeout_reconnect as *const _ as usize },
        716usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(timeout_reconnect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).timeout_sleep as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(timeout_sleep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).attemps_sleep as *const _ as usize },
        724usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(attemps_sleep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).news_langid as *const _ as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(news_langid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConFeeder>())).unused as *const _ as usize },
        732usize,
        concat!(
            "Offset of field: ",
            stringify!(ConFeeder),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGroupSec {
    pub show: ::std::os::raw::c_int,
    pub trade: ::std::os::raw::c_int,
    pub execution: ::std::os::raw::c_int,
    pub comm_base: f64,
    pub comm_type: ::std::os::raw::c_int,
    pub comm_lots: ::std::os::raw::c_int,
    pub comm_agent: f64,
    pub comm_agent_type: ::std::os::raw::c_int,
    pub spread_diff: ::std::os::raw::c_int,
    pub lot_min: ::std::os::raw::c_int,
    pub lot_max: ::std::os::raw::c_int,
    pub lot_step: ::std::os::raw::c_int,
    pub ie_deviation: ::std::os::raw::c_int,
    pub confirmation: ::std::os::raw::c_int,
    pub trade_rights: ::std::os::raw::c_int,
    pub ie_quick_mode: ::std::os::raw::c_int,
    pub autocloseout_mode: ::std::os::raw::c_int,
    pub comm_tax: f64,
    pub comm_agent_lots: ::std::os::raw::c_int,
    pub freemargin_mode: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 3usize],
}
#[test]
fn bindgen_test_layout_ConGroupSec() {
    assert_eq!(
        ::std::mem::size_of::<ConGroupSec>(),
        112usize,
        concat!("Size of: ", stringify!(ConGroupSec))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGroupSec>(),
        8usize,
        concat!("Alignment of ", stringify!(ConGroupSec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).show as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(show)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).trade as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(trade)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).execution as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(execution)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_base as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_lots as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_lots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_agent as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_agent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_agent_type as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_agent_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).spread_diff as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(spread_diff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).lot_min as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(lot_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).lot_max as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(lot_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).lot_step as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(lot_step)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).ie_deviation as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(ie_deviation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).confirmation as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(confirmation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).trade_rights as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(trade_rights)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).ie_quick_mode as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(ie_quick_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).autocloseout_mode as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(autocloseout_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_tax as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_tax)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).comm_agent_lots as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(comm_agent_lots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).freemargin_mode as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(freemargin_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupSec>())).reserved as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupSec),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGroupMargin {
    pub symbol: [::std::os::raw::c_char; 12usize],
    pub swap_long: f64,
    pub swap_short: f64,
    pub margin_divider: f64,
    pub reserved: [::std::os::raw::c_int; 7usize],
}
#[test]
fn bindgen_test_layout_ConGroupMargin() {
    assert_eq!(
        ::std::mem::size_of::<ConGroupMargin>(),
        72usize,
        concat!("Size of: ", stringify!(ConGroupMargin))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGroupMargin>(),
        8usize,
        concat!("Alignment of ", stringify!(ConGroupMargin))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupMargin>())).symbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupMargin),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupMargin>())).swap_long as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupMargin),
            "::",
            stringify!(swap_long)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupMargin>())).swap_short as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupMargin),
            "::",
            stringify!(swap_short)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupMargin>())).margin_divider as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupMargin),
            "::",
            stringify!(margin_divider)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroupMargin>())).reserved as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroupMargin),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGroup {
    pub group: [::std::os::raw::c_char; 16usize],
    pub enable: ::std::os::raw::c_int,
    pub timeout: ::std::os::raw::c_int,
    pub otp_mode: ::std::os::raw::c_int,
    pub company: [::std::os::raw::c_char; 128usize],
    pub signature: [::std::os::raw::c_char; 128usize],
    pub support_page: [::std::os::raw::c_char; 128usize],
    pub smtp_server: [::std::os::raw::c_char; 64usize],
    pub smtp_login: [::std::os::raw::c_char; 32usize],
    pub smtp_password: [::std::os::raw::c_char; 32usize],
    pub support_email: [::std::os::raw::c_char; 64usize],
    pub templates: [::std::os::raw::c_char; 32usize],
    pub copies: ::std::os::raw::c_int,
    pub reports: ::std::os::raw::c_int,
    pub default_leverage: ::std::os::raw::c_int,
    pub default_deposit: f64,
    pub maxsecurities: ::std::os::raw::c_int,
    pub secgroups: [ConGroupSec; 32usize],
    pub secmargins: [ConGroupMargin; 128usize],
    pub secmargins_total: ::std::os::raw::c_int,
    pub currency: [::std::os::raw::c_char; 12usize],
    pub credit: f64,
    pub margin_call: ::std::os::raw::c_int,
    pub margin_mode: ::std::os::raw::c_int,
    pub margin_stopout: ::std::os::raw::c_int,
    pub interestrate: f64,
    pub use_swap: ::std::os::raw::c_int,
    pub news: ::std::os::raw::c_int,
    pub rights: ::std::os::raw::c_int,
    pub check_ie_prices: ::std::os::raw::c_int,
    pub maxpositions: ::std::os::raw::c_int,
    pub close_reopen: ::std::os::raw::c_int,
    pub hedge_prohibited: ::std::os::raw::c_int,
    pub close_fifo: ::std::os::raw::c_int,
    pub hedge_largeleg: ::std::os::raw::c_int,
    pub unused_rights: [::std::os::raw::c_int; 2usize],
    pub securities_hash: [::std::os::raw::c_char; 16usize],
    pub margin_type: ::std::os::raw::c_int,
    pub archive_period: ::std::os::raw::c_int,
    pub archive_max_balance: ::std::os::raw::c_int,
    pub stopout_skip_hedged: ::std::os::raw::c_int,
    pub archive_pending_period: ::std::os::raw::c_int,
    pub news_languages: [UINT; 8usize],
    pub news_languages_total: UINT,
    pub reserved: [::std::os::raw::c_int; 17usize],
}
#[test]
fn bindgen_test_layout_ConGroup() {
    assert_eq!(
        ::std::mem::size_of::<ConGroup>(),
        13696usize,
        concat!("Size of: ", stringify!(ConGroup))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGroup>(),
        8usize,
        concat!("Alignment of ", stringify!(ConGroup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).group as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).enable as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).timeout as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).otp_mode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(otp_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).company as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(company)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).signature as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).support_page as *const _ as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(support_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).smtp_server as *const _ as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(smtp_server)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).smtp_login as *const _ as usize },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(smtp_login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).smtp_password as *const _ as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(smtp_password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).support_email as *const _ as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(support_email)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).templates as *const _ as usize },
        604usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(templates)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).copies as *const _ as usize },
        636usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(copies)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).reports as *const _ as usize },
        640usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(reports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).default_leverage as *const _ as usize },
        644usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(default_leverage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).default_deposit as *const _ as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(default_deposit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).maxsecurities as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(maxsecurities)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).secgroups as *const _ as usize },
        664usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(secgroups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).secmargins as *const _ as usize },
        4248usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(secmargins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).secmargins_total as *const _ as usize },
        13464usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(secmargins_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).currency as *const _ as usize },
        13468usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(currency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).credit as *const _ as usize },
        13480usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).margin_call as *const _ as usize },
        13488usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(margin_call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).margin_mode as *const _ as usize },
        13492usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(margin_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).margin_stopout as *const _ as usize },
        13496usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(margin_stopout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).interestrate as *const _ as usize },
        13504usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(interestrate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).use_swap as *const _ as usize },
        13512usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(use_swap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).news as *const _ as usize },
        13516usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(news)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).rights as *const _ as usize },
        13520usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(rights)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).check_ie_prices as *const _ as usize },
        13524usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(check_ie_prices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).maxpositions as *const _ as usize },
        13528usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(maxpositions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).close_reopen as *const _ as usize },
        13532usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(close_reopen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).hedge_prohibited as *const _ as usize },
        13536usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(hedge_prohibited)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).close_fifo as *const _ as usize },
        13540usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(close_fifo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).hedge_largeleg as *const _ as usize },
        13544usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(hedge_largeleg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).unused_rights as *const _ as usize },
        13548usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(unused_rights)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).securities_hash as *const _ as usize },
        13556usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(securities_hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).margin_type as *const _ as usize },
        13572usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(margin_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).archive_period as *const _ as usize },
        13576usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(archive_period)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).archive_max_balance as *const _ as usize },
        13580usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(archive_max_balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).stopout_skip_hedged as *const _ as usize },
        13584usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(stopout_skip_hedged)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).archive_pending_period as *const _ as usize },
        13588usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(archive_pending_period)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).news_languages as *const _ as usize },
        13592usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(news_languages)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).news_languages_total as *const _ as usize },
        13624usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(news_languages_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGroup>())).reserved as *const _ as usize },
        13628usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGroup),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConHoliday {
    pub year: ::std::os::raw::c_int,
    pub month: ::std::os::raw::c_int,
    pub day: ::std::os::raw::c_int,
    pub from: ::std::os::raw::c_int,
    pub to: ::std::os::raw::c_int,
    pub symbol: [::std::os::raw::c_char; 32usize],
    pub description: [::std::os::raw::c_char; 128usize],
    pub enable: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 13usize],
    pub next: *mut ConHoliday,
}
#[test]
fn bindgen_test_layout_ConHoliday() {
    assert_eq!(
        ::std::mem::size_of::<ConHoliday>(),
        240usize,
        concat!("Size of: ", stringify!(ConHoliday))
    );
    assert_eq!(
        ::std::mem::align_of::<ConHoliday>(),
        4usize,
        concat!("Alignment of ", stringify!(ConHoliday))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).year as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).month as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(month)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).day as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).from as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).to as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).symbol as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).description as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).enable as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).reserved as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConHoliday>())).next as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(ConHoliday),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LiveInfoFile {
    pub file: [::std::os::raw::c_char; 256usize],
    pub size: ::std::os::raw::c_int,
    pub hash: [::std::os::raw::c_char; 36usize],
    pub reserved: [::std::os::raw::c_int; 10usize],
}
#[test]
fn bindgen_test_layout_LiveInfoFile() {
    assert_eq!(
        ::std::mem::size_of::<LiveInfoFile>(),
        336usize,
        concat!("Size of: ", stringify!(LiveInfoFile))
    );
    assert_eq!(
        ::std::mem::align_of::<LiveInfoFile>(),
        4usize,
        concat!("Alignment of ", stringify!(LiveInfoFile))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LiveInfoFile>())).file as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LiveInfoFile),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LiveInfoFile>())).size as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(LiveInfoFile),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LiveInfoFile>())).hash as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(LiveInfoFile),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LiveInfoFile>())).reserved as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(LiveInfoFile),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConLiveUpdate {
    pub company: [::std::os::raw::c_char; 128usize],
    pub path: [::std::os::raw::c_char; 256usize],
    pub version: ::std::os::raw::c_int,
    pub build: ::std::os::raw::c_int,
    pub maxconnect: ::std::os::raw::c_int,
    pub connections: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub enable: ::std::os::raw::c_int,
    pub totalfiles: ::std::os::raw::c_int,
    pub files: [LiveInfoFile; 64usize],
    pub reserved: [::std::os::raw::c_int; 16usize],
    pub next: *mut ConLiveUpdate,
}
#[test]
fn bindgen_test_layout_ConLiveUpdate() {
    assert_eq!(
        ::std::mem::size_of::<ConLiveUpdate>(),
        21984usize,
        concat!("Size of: ", stringify!(ConLiveUpdate))
    );
    assert_eq!(
        ::std::mem::align_of::<ConLiveUpdate>(),
        4usize,
        concat!("Alignment of ", stringify!(ConLiveUpdate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).company as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(company)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).path as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).version as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).build as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).maxconnect as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(maxconnect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).connections as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(connections)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).type_ as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).enable as *const _ as usize },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).totalfiles as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(totalfiles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).files as *const _ as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(files)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).reserved as *const _ as usize },
        21916usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConLiveUpdate>())).next as *const _ as usize },
        21980usize,
        concat!(
            "Offset of field: ",
            stringify!(ConLiveUpdate),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConManagerSec {
    pub internal: ::std::os::raw::c_int,
    pub enable: ::std::os::raw::c_int,
    pub minimum_lots: ::std::os::raw::c_int,
    pub maximum_lots: ::std::os::raw::c_int,
    pub unused: [::std::os::raw::c_int; 16usize],
}
#[test]
fn bindgen_test_layout_ConManagerSec() {
    assert_eq!(
        ::std::mem::size_of::<ConManagerSec>(),
        80usize,
        concat!("Size of: ", stringify!(ConManagerSec))
    );
    assert_eq!(
        ::std::mem::align_of::<ConManagerSec>(),
        4usize,
        concat!("Alignment of ", stringify!(ConManagerSec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManagerSec>())).internal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManagerSec),
            "::",
            stringify!(internal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManagerSec>())).enable as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManagerSec),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManagerSec>())).minimum_lots as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManagerSec),
            "::",
            stringify!(minimum_lots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManagerSec>())).maximum_lots as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManagerSec),
            "::",
            stringify!(maximum_lots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManagerSec>())).unused as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManagerSec),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConManager {
    pub login: ::std::os::raw::c_int,
    pub manager: ::std::os::raw::c_int,
    pub money: ::std::os::raw::c_int,
    pub online: ::std::os::raw::c_int,
    pub riskman: ::std::os::raw::c_int,
    pub broker: ::std::os::raw::c_int,
    pub admin: ::std::os::raw::c_int,
    pub logs: ::std::os::raw::c_int,
    pub reports: ::std::os::raw::c_int,
    pub trades: ::std::os::raw::c_int,
    pub market_watch: ::std::os::raw::c_int,
    pub email: ::std::os::raw::c_int,
    pub user_details: ::std::os::raw::c_int,
    pub see_trades: ::std::os::raw::c_int,
    pub news: ::std::os::raw::c_int,
    pub plugins: ::std::os::raw::c_int,
    pub server_reports: ::std::os::raw::c_int,
    pub techsupport: ::std::os::raw::c_int,
    pub market: ::std::os::raw::c_int,
    pub notifications: ::std::os::raw::c_int,
    pub unused: [::std::os::raw::c_int; 9usize],
    pub ipfilter: ::std::os::raw::c_int,
    pub ip_from: ::std::os::raw::c_ulong,
    pub ip_to: ::std::os::raw::c_ulong,
    pub mailbox: [::std::os::raw::c_char; 64usize],
    pub groups: [::std::os::raw::c_char; 1024usize],
    pub secgroups: [ConManagerSec; 32usize],
    pub exp_time: DWORD,
    pub name: [::std::os::raw::c_char; 32usize],
    pub info_depth: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 22usize],
}
#[test]
fn bindgen_test_layout_ConManager() {
    assert_eq!(
        ::std::mem::size_of::<ConManager>(),
        3904usize,
        concat!("Size of: ", stringify!(ConManager))
    );
    assert_eq!(
        ::std::mem::align_of::<ConManager>(),
        4usize,
        concat!("Alignment of ", stringify!(ConManager))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).manager as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(manager)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).money as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(money)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).online as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(online)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).riskman as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(riskman)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).broker as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(broker)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).admin as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(admin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).logs as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(logs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).reports as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(reports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).trades as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(trades)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).market_watch as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(market_watch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).email as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(email)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).user_details as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(user_details)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).see_trades as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(see_trades)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).news as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(news)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).plugins as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(plugins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).server_reports as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(server_reports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).techsupport as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(techsupport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).market as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(market)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).notifications as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(notifications)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).unused as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).ipfilter as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(ipfilter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).ip_from as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(ip_from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).ip_to as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(ip_to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).mailbox as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(mailbox)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).groups as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(groups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).secgroups as *const _ as usize },
        1216usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(secgroups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).exp_time as *const _ as usize },
        3776usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(exp_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).name as *const _ as usize },
        3780usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).info_depth as *const _ as usize },
        3812usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(info_depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConManager>())).reserved as *const _ as usize },
        3816usize,
        concat!(
            "Offset of field: ",
            stringify!(ConManager),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConSession {
    pub open_hour: ::std::os::raw::c_short,
    pub open_min: ::std::os::raw::c_short,
    pub close_hour: ::std::os::raw::c_short,
    pub close_min: ::std::os::raw::c_short,
    pub open: ::std::os::raw::c_int,
    pub close: ::std::os::raw::c_int,
    pub align: [::std::os::raw::c_short; 7usize],
}
#[test]
fn bindgen_test_layout_ConSession() {
    assert_eq!(
        ::std::mem::size_of::<ConSession>(),
        32usize,
        concat!("Size of: ", stringify!(ConSession))
    );
    assert_eq!(
        ::std::mem::align_of::<ConSession>(),
        4usize,
        concat!("Alignment of ", stringify!(ConSession))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).open_hour as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(open_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).open_min as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(open_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).close_hour as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(close_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).close_min as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(close_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).open as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).close as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSession>())).align as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSession),
            "::",
            stringify!(align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConSessions {
    pub quote: [ConSession; 3usize],
    pub trade: [ConSession; 3usize],
    pub quote_overnight: ::std::os::raw::c_int,
    pub trade_overnight: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout_ConSessions() {
    assert_eq!(
        ::std::mem::size_of::<ConSessions>(),
        208usize,
        concat!("Size of: ", stringify!(ConSessions))
    );
    assert_eq!(
        ::std::mem::align_of::<ConSessions>(),
        4usize,
        concat!("Alignment of ", stringify!(ConSessions))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSessions>())).quote as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSessions),
            "::",
            stringify!(quote)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSessions>())).trade as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSessions),
            "::",
            stringify!(trade)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSessions>())).quote_overnight as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSessions),
            "::",
            stringify!(quote_overnight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSessions>())).trade_overnight as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSessions),
            "::",
            stringify!(trade_overnight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSessions>())).reserved as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSessions),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConSymbol {
    pub symbol: [::std::os::raw::c_char; 12usize],
    pub description: [::std::os::raw::c_char; 64usize],
    pub source: [::std::os::raw::c_char; 12usize],
    pub currency: [::std::os::raw::c_char; 12usize],
    pub type_: ::std::os::raw::c_int,
    pub digits: ::std::os::raw::c_int,
    pub trade: ::std::os::raw::c_int,
    pub background_color: COLORREF,
    pub count: ::std::os::raw::c_int,
    pub count_original: ::std::os::raw::c_int,
    pub external_unused: [::std::os::raw::c_int; 7usize],
    pub realtime: ::std::os::raw::c_int,
    pub starting: time_t,
    pub expiration: time_t,
    pub sessions: [ConSessions; 7usize],
    pub profit_mode: ::std::os::raw::c_int,
    pub profit_reserved: ::std::os::raw::c_int,
    pub filter: ::std::os::raw::c_int,
    pub filter_counter: ::std::os::raw::c_int,
    pub filter_limit: f64,
    pub filter_smoothing: ::std::os::raw::c_int,
    pub filter_reserved: f32,
    pub logging: ::std::os::raw::c_int,
    pub spread: ::std::os::raw::c_int,
    pub spread_balance: ::std::os::raw::c_int,
    pub exemode: ::std::os::raw::c_int,
    pub swap_enable: ::std::os::raw::c_int,
    pub swap_type: ::std::os::raw::c_int,
    pub swap_long: f64,
    pub swap_short: f64,
    pub swap_rollover3days: ::std::os::raw::c_int,
    pub contract_size: f64,
    pub tick_value: f64,
    pub tick_size: f64,
    pub stops_level: ::std::os::raw::c_int,
    pub gtc_pendings: ::std::os::raw::c_int,
    pub margin_mode: ::std::os::raw::c_int,
    pub margin_initial: f64,
    pub margin_maintenance: f64,
    pub margin_hedged: f64,
    pub margin_divider: f64,
    pub point: f64,
    pub multiply: f64,
    pub bid_tickvalue: f64,
    pub ask_tickvalue: f64,
    pub long_only: ::std::os::raw::c_int,
    pub instant_max_volume: ::std::os::raw::c_int,
    pub margin_currency: [::std::os::raw::c_char; 12usize],
    pub freeze_level: ::std::os::raw::c_int,
    pub margin_hedged_strong: ::std::os::raw::c_int,
    pub value_date: time_t,
    pub quotes_delay: ::std::os::raw::c_int,
    pub swap_openprice: ::std::os::raw::c_int,
    pub swap_variation_margin: ::std::os::raw::c_int,
    pub unused: [::std::os::raw::c_int; 21usize],
}
#[test]
fn bindgen_test_layout_ConSymbol() {
    assert_eq!(
        ::std::mem::size_of::<ConSymbol>(),
        1952usize,
        concat!("Size of: ", stringify!(ConSymbol))
    );
    assert_eq!(
        ::std::mem::align_of::<ConSymbol>(),
        8usize,
        concat!("Alignment of ", stringify!(ConSymbol))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).symbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).description as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).source as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).currency as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(currency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).type_ as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).digits as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(digits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).trade as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(trade)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).background_color as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(background_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).count as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).count_original as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(count_original)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).external_unused as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(external_unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).realtime as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(realtime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).starting as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(starting)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).expiration as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(expiration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).sessions as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(sessions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).profit_mode as *const _ as usize },
        1632usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(profit_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).profit_reserved as *const _ as usize },
        1636usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(profit_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).filter as *const _ as usize },
        1640usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(filter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).filter_counter as *const _ as usize },
        1644usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(filter_counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).filter_limit as *const _ as usize },
        1648usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(filter_limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).filter_smoothing as *const _ as usize },
        1656usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(filter_smoothing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).filter_reserved as *const _ as usize },
        1660usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(filter_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).logging as *const _ as usize },
        1664usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(logging)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).spread as *const _ as usize },
        1668usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(spread)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).spread_balance as *const _ as usize },
        1672usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(spread_balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).exemode as *const _ as usize },
        1676usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(exemode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_enable as *const _ as usize },
        1680usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_type as *const _ as usize },
        1684usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_long as *const _ as usize },
        1688usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_long)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_short as *const _ as usize },
        1696usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_short)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_rollover3days as *const _ as usize },
        1704usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_rollover3days)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).contract_size as *const _ as usize },
        1712usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(contract_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).tick_value as *const _ as usize },
        1720usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(tick_value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).tick_size as *const _ as usize },
        1728usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(tick_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).stops_level as *const _ as usize },
        1736usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(stops_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).gtc_pendings as *const _ as usize },
        1740usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(gtc_pendings)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_mode as *const _ as usize },
        1744usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_initial as *const _ as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_initial)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_maintenance as *const _ as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_maintenance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_hedged as *const _ as usize },
        1768usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_hedged)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_divider as *const _ as usize },
        1776usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_divider)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).point as *const _ as usize },
        1784usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(point)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).multiply as *const _ as usize },
        1792usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(multiply)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).bid_tickvalue as *const _ as usize },
        1800usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(bid_tickvalue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).ask_tickvalue as *const _ as usize },
        1808usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(ask_tickvalue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).long_only as *const _ as usize },
        1816usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(long_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).instant_max_volume as *const _ as usize },
        1820usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(instant_max_volume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_currency as *const _ as usize },
        1824usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_currency)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).freeze_level as *const _ as usize },
        1836usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(freeze_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).margin_hedged_strong as *const _ as usize },
        1840usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(margin_hedged_strong)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).value_date as *const _ as usize },
        1848usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(value_date)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).quotes_delay as *const _ as usize },
        1856usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(quotes_delay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_openprice as *const _ as usize },
        1860usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_openprice)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).swap_variation_margin as *const _ as usize },
        1864usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(swap_variation_margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbol>())).unused as *const _ as usize },
        1868usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbol),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConSymbolGroup {
    pub name: [::std::os::raw::c_char; 16usize],
    pub description: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_ConSymbolGroup() {
    assert_eq!(
        ::std::mem::size_of::<ConSymbolGroup>(),
        80usize,
        concat!("Size of: ", stringify!(ConSymbolGroup))
    );
    assert_eq!(
        ::std::mem::align_of::<ConSymbolGroup>(),
        1usize,
        concat!("Alignment of ", stringify!(ConSymbolGroup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbolGroup>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbolGroup),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConSymbolGroup>())).description as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ConSymbolGroup),
            "::",
            stringify!(description)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGatewayAccount {
    pub enable: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 64usize],
    pub id: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub login: ::std::os::raw::c_int,
    pub address: [::std::os::raw::c_char; 64usize],
    pub password: [::std::os::raw::c_char; 64usize],
    pub notify_logins: [::std::os::raw::c_int; 8usize],
    pub flags: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 23usize],
}
#[test]
fn bindgen_test_layout_ConGatewayAccount() {
    assert_eq!(
        ::std::mem::size_of::<ConGatewayAccount>(),
        336usize,
        concat!("Size of: ", stringify!(ConGatewayAccount))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGatewayAccount>(),
        4usize,
        concat!("Alignment of ", stringify!(ConGatewayAccount))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).enable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).id as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).type_ as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).login as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).address as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).password as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).notify_logins as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(notify_logins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).flags as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayAccount>())).reserved as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayAccount),
            "::",
            stringify!(reserved)
        )
    );
}
pub const EnGatewayAccountFlags_GATEWAY_FLAG_NONE: EnGatewayAccountFlags = 0;
pub const EnGatewayAccountFlags_GATEWAY_FLAG_QUOTES: EnGatewayAccountFlags = 1;
pub type EnGatewayAccountFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGatewayMarkup {
    pub enable: ::std::os::raw::c_int,
    pub source: [::std::os::raw::c_char; 128usize],
    pub symbol: [::std::os::raw::c_char; 12usize],
    pub account_name: [::std::os::raw::c_char; 64usize],
    pub account_id: ::std::os::raw::c_int,
    pub bid_markup: ::std::os::raw::c_int,
    pub ask_markup: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 16usize],
}
#[test]
fn bindgen_test_layout_ConGatewayMarkup() {
    assert_eq!(
        ::std::mem::size_of::<ConGatewayMarkup>(),
        284usize,
        concat!("Size of: ", stringify!(ConGatewayMarkup))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGatewayMarkup>(),
        4usize,
        concat!("Alignment of ", stringify!(ConGatewayMarkup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).enable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).source as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).symbol as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).account_name as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(account_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).account_id as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(account_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).bid_markup as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(bid_markup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).ask_markup as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(ask_markup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayMarkup>())).reserved as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayMarkup),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConGatewayRule {
    pub enable: ::std::os::raw::c_int,
    pub name: [::std::os::raw::c_char; 64usize],
    pub request_symbol: [::std::os::raw::c_char; 128usize],
    pub request_group: [::std::os::raw::c_char; 128usize],
    pub request_reserved: [::std::os::raw::c_int; 32usize],
    pub exe_account_name: [::std::os::raw::c_char; 64usize],
    pub exe_account_id: ::std::os::raw::c_int,
    pub exe_max_deviation: ::std::os::raw::c_int,
    pub exe_max_profit_slippage: ::std::os::raw::c_int,
    pub exe_max_profit_slippage_lots: ::std::os::raw::c_int,
    pub exe_max_losing_slippage: ::std::os::raw::c_int,
    pub exe_max_losing_slippage_lots: ::std::os::raw::c_int,
    pub exe_account_pos: ::std::os::raw::c_int,
    pub exe_volume_percent: ::std::os::raw::c_int,
    pub exe_flags: ::std::os::raw::c_int,
    pub exe_reserved: [::std::os::raw::c_int; 25usize],
}
#[test]
fn bindgen_test_layout_ConGatewayRule() {
    assert_eq!(
        ::std::mem::size_of::<ConGatewayRule>(),
        652usize,
        concat!("Size of: ", stringify!(ConGatewayRule))
    );
    assert_eq!(
        ::std::mem::align_of::<ConGatewayRule>(),
        4usize,
        concat!("Alignment of ", stringify!(ConGatewayRule))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).enable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).name as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).request_symbol as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(request_symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).request_group as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(request_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).request_reserved as *const _ as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(request_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).exe_account_name as *const _ as usize },
        452usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_account_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).exe_account_id as *const _ as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_account_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_max_deviation as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_max_deviation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_max_profit_slippage as *const _ as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_max_profit_slippage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_max_profit_slippage_lots as *const _
                as usize
        },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_max_profit_slippage_lots)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_max_losing_slippage as *const _ as usize
        },
        532usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_max_losing_slippage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_max_losing_slippage_lots as *const _
                as usize
        },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_max_losing_slippage_lots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).exe_account_pos as *const _ as usize },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_account_pos)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<ConGatewayRule>())).exe_volume_percent as *const _ as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_volume_percent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).exe_flags as *const _ as usize },
        548usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ConGatewayRule>())).exe_reserved as *const _ as usize },
        552usize,
        concat!(
            "Offset of field: ",
            stringify!(ConGatewayRule),
            "::",
            stringify!(exe_reserved)
        )
    );
}
pub const EnGatewayRuleFlags_GATEWAY_RULE_FLAG_NONE: EnGatewayRuleFlags = 0;
pub const EnGatewayRuleFlags_GATEWAY_RULE_FLAG_DEALER: EnGatewayRuleFlags = 1;
pub type EnGatewayRuleFlags = ::std::os::raw::c_int;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct FeedTick {
    pub symbol: [::std::os::raw::c_char; 16usize],
    pub ctm: time_t,
    pub bank: [::std::os::raw::c_char; 32usize],
    pub bid: f64,
    pub ask: f64,
    pub feeder: ::std::os::raw::c_int,
    pub reverved: [::std::os::raw::c_char; 8usize],
}
#[test]
fn bindgen_test_layout_FeedTick() {
    assert_eq!(
        ::std::mem::size_of::<FeedTick>(),
        84usize,
        concat!("Size of: ", stringify!(FeedTick))
    );
    assert_eq!(
        ::std::mem::align_of::<FeedTick>(),
        1usize,
        concat!("Alignment of ", stringify!(FeedTick))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).symbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).ctm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).bank as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).bid as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(bid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).ask as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(ask)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).feeder as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(feeder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedTick>())).reverved as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedTick),
            "::",
            stringify!(reverved)
        )
    );
}
pub const EnTickSources_TICK_SRC_DEALER_AUTO: EnTickSources = -1;
pub const EnTickSources_TICK_SRC_DEALER_MANUAL: EnTickSources = -2;
pub const EnTickSources_TICK_SRC_GATEWAY: EnTickSources = -128;
pub type EnTickSources = ::std::os::raw::c_int;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct FeedData {
    pub ticks: [FeedTick; 32usize],
    pub ticks_count: ::std::os::raw::c_int,
    pub news_time: [::std::os::raw::c_char; 32usize],
    pub subject: [::std::os::raw::c_char; 256usize],
    pub category: [::std::os::raw::c_char; 64usize],
    pub keywords: [::std::os::raw::c_char; 256usize],
    pub body: *mut ::std::os::raw::c_char,
    pub body_len: ::std::os::raw::c_int,
    pub body_maxlen: ::std::os::raw::c_int,
    pub result: ::std::os::raw::c_int,
    pub result_string: [::std::os::raw::c_char; 256usize],
    pub feeder: ::std::os::raw::c_int,
    pub mode: ::std::os::raw::c_int,
    pub langid: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_FeedData() {
    assert_eq!(
        ::std::mem::size_of::<FeedData>(),
        3648usize,
        concat!("Size of: ", stringify!(FeedData))
    );
    assert_eq!(
        ::std::mem::align_of::<FeedData>(),
        1usize,
        concat!("Alignment of ", stringify!(FeedData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).ticks as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(ticks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).ticks_count as *const _ as usize },
        2688usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(ticks_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).news_time as *const _ as usize },
        2692usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(news_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).subject as *const _ as usize },
        2724usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(subject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).category as *const _ as usize },
        2980usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(category)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).keywords as *const _ as usize },
        3044usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(keywords)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).body as *const _ as usize },
        3300usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(body)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).body_len as *const _ as usize },
        3304usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(body_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).body_maxlen as *const _ as usize },
        3308usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(body_maxlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).result as *const _ as usize },
        3312usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(result)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).result_string as *const _ as usize },
        3316usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(result_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).feeder as *const _ as usize },
        3572usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(feeder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).mode as *const _ as usize },
        3576usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).langid as *const _ as usize },
        3580usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(langid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedData>())).reserved as *const _ as usize },
        3584usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedData),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct FeedNews {
    pub language: UINT,
    pub subject: [u16; 256usize],
    pub category: [u16; 256usize],
    pub flags: UINT,
    pub body: *mut u16,
    pub body_len: UINT,
    pub languages_list: [UINT; 32usize],
    pub datetime: INT64,
    pub reserved: [UINT; 30usize],
}
pub const FeedNews_constants_MAX_NEWS_BODY_LEN: FeedNews_constants = 15728640;
pub type FeedNews_constants = ::std::os::raw::c_int;
pub const FeedNews_EnNewsFlags_FLAG_PRIORITY: FeedNews_EnNewsFlags = 1;
pub const FeedNews_EnNewsFlags_FLAG_CALENDAR: FeedNews_EnNewsFlags = 2;
pub const FeedNews_EnNewsFlags_FLAG_MIME: FeedNews_EnNewsFlags = 4;
pub const FeedNews_EnNewsFlags_FLAG_ALLOW_DEMO: FeedNews_EnNewsFlags = 8;
pub type FeedNews_EnNewsFlags = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_FeedNews() {
    assert_eq!(
        ::std::mem::size_of::<FeedNews>(),
        1296usize,
        concat!("Size of: ", stringify!(FeedNews))
    );
    assert_eq!(
        ::std::mem::align_of::<FeedNews>(),
        1usize,
        concat!("Alignment of ", stringify!(FeedNews))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).language as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(language)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).subject as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(subject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).category as *const _ as usize },
        516usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(category)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).flags as *const _ as usize },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).body as *const _ as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(body)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).body_len as *const _ as usize },
        1036usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(body_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).languages_list as *const _ as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(languages_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).datetime as *const _ as usize },
        1168usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(datetime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FeedNews>())).reserved as *const _ as usize },
        1176usize,
        concat!(
            "Offset of field: ",
            stringify!(FeedNews),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct LogInfo {
    pub code: ::std::os::raw::c_int,
    pub ip: [::std::os::raw::c_char; 64usize],
    pub msg: [::std::os::raw::c_char; 512usize],
    pub ctm: tm,
    pub unused: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout_LogInfo() {
    assert_eq!(
        ::std::mem::size_of::<LogInfo>(),
        624usize,
        concat!("Size of: ", stringify!(LogInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<LogInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(LogInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogInfo>())).code as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LogInfo),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogInfo>())).ip as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(LogInfo),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogInfo>())).msg as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(LogInfo),
            "::",
            stringify!(msg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogInfo>())).ctm as *const _ as usize },
        580usize,
        concat!(
            "Offset of field: ",
            stringify!(LogInfo),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogInfo>())).unused as *const _ as usize },
        616usize,
        concat!(
            "Offset of field: ",
            stringify!(LogInfo),
            "::",
            stringify!(unused)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LogRequest {
    pub mode: ::std::os::raw::c_char,
    pub from: time_t,
    pub to: time_t,
    pub filter: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_LogRequest() {
    assert_eq!(
        ::std::mem::size_of::<LogRequest>(),
        88usize,
        concat!("Size of: ", stringify!(LogRequest))
    );
    assert_eq!(
        ::std::mem::align_of::<LogRequest>(),
        8usize,
        concat!("Alignment of ", stringify!(LogRequest))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogRequest>())).mode as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LogRequest),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogRequest>())).from as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LogRequest),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogRequest>())).to as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LogRequest),
            "::",
            stringify!(to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LogRequest>())).filter as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LogRequest),
            "::",
            stringify!(filter)
        )
    );
}
pub const EnLogType_LOG_TYPE_STANDARD: EnLogType = 0;
pub const EnLogType_LOG_TYPE_LOGINS: EnLogType = 1;
pub const EnLogType_LOG_TYPE_TRADES: EnLogType = 2;
pub const EnLogType_LOG_TYPE_ERRORS: EnLogType = 3;
pub const EnLogType_LOG_TYPE_FULL: EnLogType = 4;
pub type EnLogType = ::std::os::raw::c_int;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct PerformanceInfo {
    pub ctm: time_t,
    pub users: ::std::os::raw::c_short,
    pub cpu: ::std::os::raw::c_short,
    pub freemem: ::std::os::raw::c_int,
    pub network: ::std::os::raw::c_int,
    pub sockets: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_PerformanceInfo() {
    assert_eq!(
        ::std::mem::size_of::<PerformanceInfo>(),
        24usize,
        concat!("Size of: ", stringify!(PerformanceInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<PerformanceInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(PerformanceInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).ctm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).users as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(users)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).cpu as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(cpu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).freemem as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(freemem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).network as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(network)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PerformanceInfo>())).sockets as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PerformanceInfo),
            "::",
            stringify!(sockets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserRecord {
    pub login: ::std::os::raw::c_int,
    pub group: [::std::os::raw::c_char; 16usize],
    pub password: [::std::os::raw::c_char; 16usize],
    pub enable: ::std::os::raw::c_int,
    pub enable_change_password: ::std::os::raw::c_int,
    pub enable_read_only: ::std::os::raw::c_int,
    pub enable_otp: ::std::os::raw::c_int,
    pub enable_reserved: [::std::os::raw::c_int; 2usize],
    pub password_investor: [::std::os::raw::c_char; 16usize],
    pub password_phone: [::std::os::raw::c_char; 32usize],
    pub name: [::std::os::raw::c_char; 128usize],
    pub country: [::std::os::raw::c_char; 32usize],
    pub city: [::std::os::raw::c_char; 32usize],
    pub state: [::std::os::raw::c_char; 32usize],
    pub zipcode: [::std::os::raw::c_char; 16usize],
    pub address: [::std::os::raw::c_char; 96usize],
    pub lead_source: [::std::os::raw::c_char; 32usize],
    pub phone: [::std::os::raw::c_char; 32usize],
    pub email: [::std::os::raw::c_char; 48usize],
    pub comment: [::std::os::raw::c_char; 64usize],
    pub id: [::std::os::raw::c_char; 32usize],
    pub status: [::std::os::raw::c_char; 16usize],
    pub regdate: time_t,
    pub lastdate: time_t,
    pub leverage: ::std::os::raw::c_int,
    pub agent_account: ::std::os::raw::c_int,
    pub timestamp: time_t,
    pub last_ip: ::std::os::raw::c_int,
    pub balance: f64,
    pub prevmonthbalance: f64,
    pub prevbalance: f64,
    pub credit: f64,
    pub interestrate: f64,
    pub taxes: f64,
    pub prevmonthequity: f64,
    pub prevequity: f64,
    pub reserved2: [f64; 2usize],
    pub otp_secret: [::std::os::raw::c_char; 32usize],
    pub secure_reserved: [::std::os::raw::c_char; 240usize],
    pub send_reports: ::std::os::raw::c_int,
    pub mqid: ::std::os::raw::c_uint,
    pub user_color: COLORREF,
    pub unused: [::std::os::raw::c_char; 40usize],
    pub api_data: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_UserRecord() {
    assert_eq!(
        ::std::mem::size_of::<UserRecord>(),
        1136usize,
        concat!("Size of: ", stringify!(UserRecord))
    );
    assert_eq!(
        ::std::mem::align_of::<UserRecord>(),
        8usize,
        concat!("Alignment of ", stringify!(UserRecord))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).group as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).password as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).enable as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<UserRecord>())).enable_change_password as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(enable_change_password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).enable_read_only as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(enable_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).enable_otp as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(enable_otp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).enable_reserved as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(enable_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).password_investor as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(password_investor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).password_phone as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(password_phone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).name as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).country as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(country)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).city as *const _ as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(city)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).state as *const _ as usize },
        300usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).zipcode as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(zipcode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).address as *const _ as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).lead_source as *const _ as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(lead_source)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).phone as *const _ as usize },
        476usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(phone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).email as *const _ as usize },
        508usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(email)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).comment as *const _ as usize },
        556usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).id as *const _ as usize },
        620usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).status as *const _ as usize },
        652usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).regdate as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(regdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).lastdate as *const _ as usize },
        680usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(lastdate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).leverage as *const _ as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(leverage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).agent_account as *const _ as usize },
        692usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(agent_account)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).timestamp as *const _ as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).last_ip as *const _ as usize },
        704usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(last_ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).balance as *const _ as usize },
        712usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).prevmonthbalance as *const _ as usize },
        720usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(prevmonthbalance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).prevbalance as *const _ as usize },
        728usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(prevbalance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).credit as *const _ as usize },
        736usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).interestrate as *const _ as usize },
        744usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(interestrate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).taxes as *const _ as usize },
        752usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(taxes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).prevmonthequity as *const _ as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(prevmonthequity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).prevequity as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(prevequity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).reserved2 as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(reserved2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).otp_secret as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(otp_secret)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).secure_reserved as *const _ as usize },
        824usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(secure_reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).send_reports as *const _ as usize },
        1064usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(send_reports)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).mqid as *const _ as usize },
        1068usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(mqid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).user_color as *const _ as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(user_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).unused as *const _ as usize },
        1076usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(unused)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserRecord>())).api_data as *const _ as usize },
        1116usize,
        concat!(
            "Offset of field: ",
            stringify!(UserRecord),
            "::",
            stringify!(api_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UserInfo {
    pub login: ::std::os::raw::c_int,
    pub group: [::std::os::raw::c_char; 16usize],
    pub password: [::std::os::raw::c_char; 16usize],
    pub name: [::std::os::raw::c_char; 128usize],
    pub ip: [::std::os::raw::c_char; 16usize],
    pub enable: ::std::os::raw::c_int,
    pub enable_change_password: ::std::os::raw::c_int,
    pub enable_read_only: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub leverage: ::std::os::raw::c_int,
    pub agent_account: ::std::os::raw::c_int,
    pub balance: f64,
    pub credit: f64,
    pub prevbalance: f64,
    pub grp: ConGroup,
}
#[test]
fn bindgen_test_layout_UserInfo() {
    assert_eq!(
        ::std::mem::size_of::<UserInfo>(),
        13928usize,
        concat!("Size of: ", stringify!(UserInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<UserInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(UserInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).group as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).password as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).name as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).ip as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).enable as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).enable_change_password as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(enable_change_password)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).enable_read_only as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(enable_read_only)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).flags as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).leverage as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(leverage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).agent_account as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(agent_account)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).balance as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).credit as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).prevbalance as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(prevbalance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<UserInfo>())).grp as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(UserInfo),
            "::",
            stringify!(grp)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct RateInfo {
    pub ctm: time_t,
    pub open: ::std::os::raw::c_int,
    pub high: ::std::os::raw::c_int,
    pub low: ::std::os::raw::c_int,
    pub close: ::std::os::raw::c_int,
    pub vol: f64,
}
#[test]
fn bindgen_test_layout_RateInfo() {
    assert_eq!(
        ::std::mem::size_of::<RateInfo>(),
        32usize,
        concat!("Size of: ", stringify!(RateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RateInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(RateInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).ctm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).open as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).high as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).low as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(low)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).close as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RateInfo>())).vol as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(RateInfo),
            "::",
            stringify!(vol)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TickAPI {
    pub ctm: time_t,
    pub bid: f64,
    pub ask: f64,
}
#[test]
fn bindgen_test_layout_TickAPI() {
    assert_eq!(
        ::std::mem::size_of::<TickAPI>(),
        24usize,
        concat!("Size of: ", stringify!(TickAPI))
    );
    assert_eq!(
        ::std::mem::align_of::<TickAPI>(),
        8usize,
        concat!("Alignment of ", stringify!(TickAPI))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TickAPI>())).ctm as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TickAPI),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TickAPI>())).bid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TickAPI),
            "::",
            stringify!(bid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TickAPI>())).ask as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TickAPI),
            "::",
            stringify!(ask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MailBoxHeader {
    pub time: time_t,
    pub sender: ::std::os::raw::c_int,
    pub from: [::std::os::raw::c_char; 64usize],
    pub to: ::std::os::raw::c_int,
    pub subject: [::std::os::raw::c_char; 128usize],
    pub read: ::std::os::raw::c_int,
    pub body: *mut ::std::os::raw::c_char,
    pub bodylen: ::std::os::raw::c_int,
    pub min_build: ::std::os::raw::c_ushort,
    pub max_build: ::std::os::raw::c_ushort,
    pub reserved: [::std::os::raw::c_int; 1usize],
}
#[test]
fn bindgen_test_layout_MailBoxHeader() {
    assert_eq!(
        ::std::mem::size_of::<MailBoxHeader>(),
        232usize,
        concat!("Size of: ", stringify!(MailBoxHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<MailBoxHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(MailBoxHeader))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).time as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).sender as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(sender)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).from as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(from)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).to as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(to)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).subject as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(subject)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).read as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).body as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(body)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).bodylen as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(bodylen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).min_build as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(min_build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).max_build as *const _ as usize },
        222usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(max_build)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MailBoxHeader>())).reserved as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(MailBoxHeader),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct TradeTransInfo {
    pub type_: UCHAR,
    pub flags: ::std::os::raw::c_char,
    pub cmd: ::std::os::raw::c_short,
    pub order: ::std::os::raw::c_int,
    pub orderby: ::std::os::raw::c_int,
    pub symbol: [::std::os::raw::c_char; 12usize],
    pub volume: ::std::os::raw::c_int,
    pub price: f64,
    pub sl: f64,
    pub tp: f64,
    pub ie_deviation: ::std::os::raw::c_int,
    pub comment: [::std::os::raw::c_char; 32usize],
    pub expiration: time_t,
    pub crc: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_TradeTransInfo() {
    assert_eq!(
        ::std::mem::size_of::<TradeTransInfo>(),
        100usize,
        concat!("Size of: ", stringify!(TradeTransInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<TradeTransInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(TradeTransInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).flags as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).cmd as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).order as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).orderby as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(orderby)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).symbol as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).volume as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).price as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).sl as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).tp as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(tp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).ie_deviation as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(ie_deviation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).comment as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).expiration as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(expiration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeTransInfo>())).crc as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeTransInfo),
            "::",
            stringify!(crc)
        )
    );
}
pub const EnReqFlags_TT_FLAG_NONE: EnReqFlags = 0;
pub const EnReqFlags_TT_FLAG_SIGNAL: EnReqFlags = 1;
pub const EnReqFlags_TT_FLAG_EXPERT: EnReqFlags = 2;
pub const EnReqFlags_TT_FLAG_GATEWAY: EnReqFlags = 4;
pub const EnReqFlags_TT_FLAG_MOBILE: EnReqFlags = 8;
pub const EnReqFlags_TT_FLAG_WEB: EnReqFlags = 16;
pub const EnReqFlags_TT_FLAG_API: EnReqFlags = 32;
pub type EnReqFlags = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RequestInfo {
    pub id: ::std::os::raw::c_int,
    pub status: ::std::os::raw::c_int,
    pub time: DWORD,
    pub manager: ::std::os::raw::c_int,
    pub login: ::std::os::raw::c_int,
    pub group: [::std::os::raw::c_char; 16usize],
    pub balance: f64,
    pub credit: f64,
    pub prices: [f64; 2usize],
    pub trade: TradeTransInfo,
    pub gw_volume: ::std::os::raw::c_int,
    pub gw_order: ::std::os::raw::c_int,
    pub gw_price: ::std::os::raw::c_short,
    pub reserved: ::std::os::raw::c_short,
    pub prev: *mut RequestInfo,
    pub next: *mut RequestInfo,
}
#[test]
fn bindgen_test_layout_RequestInfo() {
    assert_eq!(
        ::std::mem::size_of::<RequestInfo>(),
        192usize,
        concat!("Size of: ", stringify!(RequestInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<RequestInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(RequestInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).status as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).time as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).manager as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(manager)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).login as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).group as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).balance as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).credit as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).prices as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(prices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).trade as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(trade)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).gw_volume as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(gw_volume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).gw_order as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(gw_order)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).gw_price as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(gw_price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).reserved as *const _ as usize },
        182usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(reserved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).prev as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<RequestInfo>())).next as *const _ as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(RequestInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct TradeRecord {
    pub order: ::std::os::raw::c_int,
    pub login: ::std::os::raw::c_int,
    pub symbol: [::std::os::raw::c_char; 12usize],
    pub digits: ::std::os::raw::c_int,
    pub cmd: ::std::os::raw::c_int,
    pub volume: ::std::os::raw::c_int,
    pub open_time: time_t,
    pub state: ::std::os::raw::c_int,
    pub open_price: f64,
    pub sl: f64,
    pub tp: f64,
    pub close_time: time_t,
    pub gw_volume: ::std::os::raw::c_int,
    pub expiration: time_t,
    pub reason: ::std::os::raw::c_char,
    pub conv_reserv: [::std::os::raw::c_char; 3usize],
    pub conv_rates: [f64; 2usize],
    pub commission: f64,
    pub commission_agent: f64,
    pub storage: f64,
    pub close_price: f64,
    pub profit: f64,
    pub taxes: f64,
    pub magic: ::std::os::raw::c_int,
    pub comment: [::std::os::raw::c_char; 32usize],
    pub gw_order: ::std::os::raw::c_int,
    pub activation: ::std::os::raw::c_int,
    pub gw_open_price: ::std::os::raw::c_short,
    pub gw_close_price: ::std::os::raw::c_short,
    pub margin_rate: f64,
    pub timestamp: time_t,
    pub api_data: [::std::os::raw::c_int; 4usize],
    pub next: *mut TradeRecord,
}
#[test]
fn bindgen_test_layout_TradeRecord() {
    assert_eq!(
        ::std::mem::size_of::<TradeRecord>(),
        240usize,
        concat!("Size of: ", stringify!(TradeRecord))
    );
    assert_eq!(
        ::std::mem::align_of::<TradeRecord>(),
        1usize,
        concat!("Alignment of ", stringify!(TradeRecord))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).order as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).login as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).symbol as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).digits as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(digits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).cmd as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(cmd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).volume as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(volume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).open_time as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(open_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).state as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).open_price as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(open_price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).sl as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).tp as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(tp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).close_time as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(close_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).gw_volume as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(gw_volume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).expiration as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(expiration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).reason as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(reason)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).conv_reserv as *const _ as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(conv_reserv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).conv_rates as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(conv_rates)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).commission as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(commission)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).commission_agent as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(commission_agent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).storage as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(storage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).close_price as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(close_price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).profit as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(profit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).taxes as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(taxes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).magic as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).comment as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).gw_order as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(gw_order)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).activation as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(activation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).gw_open_price as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(gw_open_price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).gw_close_price as *const _ as usize },
        202usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(gw_close_price)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).margin_rate as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(margin_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).timestamp as *const _ as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).api_data as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(api_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TradeRecord>())).next as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(TradeRecord),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MarginLevel {
    pub login: ::std::os::raw::c_int,
    pub leverage: ::std::os::raw::c_int,
    pub updated: ::std::os::raw::c_int,
    pub balance: f64,
    pub margin: f64,
    pub equity: f64,
}
#[test]
fn bindgen_test_layout_MarginLevel() {
    assert_eq!(
        ::std::mem::size_of::<MarginLevel>(),
        40usize,
        concat!("Size of: ", stringify!(MarginLevel))
    );
    assert_eq!(
        ::std::mem::align_of::<MarginLevel>(),
        8usize,
        concat!("Alignment of ", stringify!(MarginLevel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).leverage as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(leverage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).updated as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(updated)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).balance as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).margin as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MarginLevel>())).equity as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MarginLevel),
            "::",
            stringify!(equity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OverNightData {
    pub symbol: ConSymbol,
    pub point: f64,
    pub trades: *mut *mut TradeRecord,
    pub trades_total: ::std::os::raw::c_int,
    pub trades_max: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_OverNightData() {
    assert_eq!(
        ::std::mem::size_of::<OverNightData>(),
        1976usize,
        concat!("Size of: ", stringify!(OverNightData))
    );
    assert_eq!(
        ::std::mem::align_of::<OverNightData>(),
        8usize,
        concat!("Alignment of ", stringify!(OverNightData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OverNightData>())).symbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OverNightData),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OverNightData>())).point as *const _ as usize },
        1952usize,
        concat!(
            "Offset of field: ",
            stringify!(OverNightData),
            "::",
            stringify!(point)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OverNightData>())).trades as *const _ as usize },
        1960usize,
        concat!(
            "Offset of field: ",
            stringify!(OverNightData),
            "::",
            stringify!(trades)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OverNightData>())).trades_total as *const _ as usize },
        1964usize,
        concat!(
            "Offset of field: ",
            stringify!(OverNightData),
            "::",
            stringify!(trades_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OverNightData>())).trades_max as *const _ as usize },
        1968usize,
        concat!(
            "Offset of field: ",
            stringify!(OverNightData),
            "::",
            stringify!(trades_max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DailyReport {
    pub login: ::std::os::raw::c_int,
    pub ctm: time_t,
    pub group: [::std::os::raw::c_char; 16usize],
    pub bank: [::std::os::raw::c_char; 64usize],
    pub balance_prev: f64,
    pub balance: f64,
    pub deposit: f64,
    pub credit: f64,
    pub profit_closed: f64,
    pub profit: f64,
    pub equity: f64,
    pub margin: f64,
    pub margin_free: f64,
    pub next: ::std::os::raw::c_int,
    pub reserved: [::std::os::raw::c_int; 3usize],
}
#[test]
fn bindgen_test_layout_DailyReport() {
    assert_eq!(
        ::std::mem::size_of::<DailyReport>(),
        184usize,
        concat!("Size of: ", stringify!(DailyReport))
    );
    assert_eq!(
        ::std::mem::align_of::<DailyReport>(),
        8usize,
        concat!("Alignment of ", stringify!(DailyReport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).login as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(login)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).ctm as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(ctm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).group as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).bank as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).balance_prev as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(balance_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).balance as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(balance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).deposit as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(deposit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).credit as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).profit_closed as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(profit_closed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).profit as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(profit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).equity as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(equity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).margin as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).margin_free as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(margin_free)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).next as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DailyReport>())).reserved as *const _ as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(DailyReport),
            "::",
            stringify!(reserved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StateReport {
    pub deposit: f64,
    pub credit: f64,
    pub closed_profit: f64,
    pub closed_commission: f64,
    pub closed_swap: f64,
    pub closed_taxes: f64,
    pub profit: f64,
    pub commission: f64,
    pub swap: f64,
    pub equity: f64,
    pub taxes: f64,
    pub margin: f64,
    pub margin_free: f64,
}
#[test]
fn bindgen_test_layout_StateReport() {
    assert_eq!(
        ::std::mem::size_of::<StateReport>(),
        104usize,
        concat!("Size of: ", stringify!(StateReport))
    );
    assert_eq!(
        ::std::mem::align_of::<StateReport>(),
        8usize,
        concat!("Alignment of ", stringify!(StateReport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).deposit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(deposit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).credit as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(credit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).closed_profit as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(closed_profit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).closed_commission as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(closed_commission)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).closed_swap as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(closed_swap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).closed_taxes as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(closed_taxes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).profit as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(profit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).commission as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(commission)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).swap as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(swap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).equity as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(equity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).taxes as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(taxes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).margin as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<StateReport>())).margin_free as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(StateReport),
            "::",
            stringify!(margin_free)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GroupState {
    pub group: ConGroup,
    pub users: *mut UserRecord,
    pub users_total: ::std::os::raw::c_int,
    pub trades: *mut TradeRecord,
    pub trades_total: ::std::os::raw::c_int,
    pub margins: *mut MarginLevel,
    pub margins_total: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GroupState() {
    assert_eq!(
        ::std::mem::size_of::<GroupState>(),
        13720usize,
        concat!("Size of: ", stringify!(GroupState))
    );
    assert_eq!(
        ::std::mem::align_of::<GroupState>(),
        8usize,
        concat!("Alignment of ", stringify!(GroupState))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).group as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).users as *const _ as usize },
        13696usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(users)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).users_total as *const _ as usize },
        13700usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(users_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).trades as *const _ as usize },
        13704usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(trades)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).trades_total as *const _ as usize },
        13708usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(trades_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).margins as *const _ as usize },
        13712usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(margins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GroupState>())).margins_total as *const _ as usize },
        13716usize,
        concat!(
            "Offset of field: ",
            stringify!(GroupState),
            "::",
            stringify!(margins_total)
        )
    );
}
#[repr(C)]
pub struct CServerInterface__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CServerInterface {
    pub vtable_: *const CServerInterface__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_CServerInterface() {
    assert_eq!(
        ::std::mem::size_of::<CServerInterface>(),
        4usize,
        concat!("Size of: ", stringify!(CServerInterface))
    );
    assert_eq!(
        ::std::mem::align_of::<CServerInterface>(),
        4usize,
        concat!("Alignment of ", stringify!(CServerInterface))
    );
}
extern "stdcall" {
    #[link_name = "\u{1}?Version@CServerInterface@@UAGHXZ"]
    pub fn CServerInterface_Version(this: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "stdcall" {
    #[link_name = "\u{1}?TradeTime@CServerInterface@@UAG_JXZ"]
    pub fn CServerInterface_TradeTime(this: *mut ::std::os::raw::c_void) -> time_t;
}
extern "stdcall" {
    #[link_name = "\u{1}?AccessAdd@CServerInterface@@UAGHHPBUConAccess@@@Z"]
    pub fn CServerInterface_AccessAdd(
        this: *mut ::std::os::raw::c_void,
        pos: ::std::os::raw::c_int,
        acc: *const ConAccess,
    ) -> ::std::os::raw::c_int;
}
extern "stdcall" {
    #[link_name = "\u{1}?AccessDelete@CServerInterface@@UAGHH@Z"]
    pub fn CServerInterface_AccessDelete(
        this: *mut ::std::os::raw::c_void,
        pos: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "stdcall" {
